---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.PartialFailureResults.HaveDifferentOffsets
enum: Autodesk.Revit.DB.Fabrication.PartialFailureResults
source: html/e8c25aa2-8fca-83e8-14ac-0b7c29943caa.htm
---
# Autodesk.Revit.DB.Fabrication.PartialFailureResults.HaveDifferentOffsets

Converted fabrication parts have different offsets.